In [1]:
import pandas as pd

In [2]:
data={"Name":["Anjal","Haris","Akash"],"Age":[25,22,20]}
data

{'Name': ['Anjal', 'Haris', 'Akash'], 'Age': [25, 22, 20]}

In [3]:
data={"Name":["Anjal","Haris","Akash"],"Age":[25,22,20]}
df=pd.Series(data)
df

Name    [Anjal, Haris, Akash]
Age              [25, 22, 20]
dtype: object

In [4]:
data={"Name":["Anjal","Haris","Akash"],"Age":[25,22,20]}
df=pd.DataFrame(data)
df

    Name  Age
0  Anjal   25
1  Haris   22
2  Akash   20

In [5]:
df=pd.read_csv("sample.csv")
df

    Name Brand Model  number
0    BMW    B1   NaN  4545.0
1   Benz   NaN    w2  5645.0
2    NaN    A1   NaN  8989.0
3    BMW    B1    w1     NaN
4   Benz   Be1    w2  3445.0
5    NaN    B1    w1    45.0
6   Benz   Be1   NaN  5656.0
7    NaN   Be1    w2  3445.0
8    BMW    B1    w1    45.0
9   Benz   Be1   NaN  5656.0
10  Benz   Be1   NaN  5656.0
11   NaN   Be1    w2  3445.0
12   BMW    B1    w1    45.0
13  Benz   Be1   NaN  5656.0
14  Benz   Be1   NaN  5656.0

In [6]:
df=pd.read_csv("student_marks.csv")
df

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

In [7]:
df=pd.read_csv("student_marks.csv")
df.head(5)

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53

In [8]:
df=pd.read_csv("student_marks.csv")
df.tail(5)

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

In [9]:
df=pd.read_csv("sample.csv")
df.add_prefix("car_")

   car_Name car_Brand car_Model  car_number
0       BMW        B1       NaN      4545.0
1      Benz       NaN        w2      5645.0
2       NaN        A1       NaN      8989.0
3       BMW        B1        w1         NaN
4      Benz       Be1        w2      3445.0
5       NaN        B1        w1        45.0
6      Benz       Be1       NaN      5656.0
7       NaN       Be1        w2      3445.0
8       BMW        B1        w1        45.0
9      Benz       Be1       NaN      5656.0
10     Benz       Be1       NaN      5656.0
11      NaN       Be1        w2      3445.0
12      BMW        B1        w1        45.0
13     Benz       Be1       NaN      5656.0
14     Benz       Be1       NaN      5656.0

In [10]:
df=pd.read_csv("sample.csv")
df.add_suffix("_of_car")

   Name_of_car Brand_of_car Model_of_car  number_of_car
0          BMW           B1          NaN         4545.0
1         Benz          NaN           w2         5645.0
2          NaN           A1          NaN         8989.0
3          BMW           B1           w1            NaN
4         Benz          Be1           w2         3445.0
5          NaN           B1           w1           45.0
6         Benz          Be1          NaN         5656.0
7          NaN          Be1           w2         3445.0
8          BMW           B1           w1           45.0
9         Benz          Be1          NaN         5656.0
10        Benz          Be1          NaN         5656.0
11         NaN          Be1           w2         3445.0
12         BMW           B1           w1           45.0
13        Benz          Be1          NaN         5656.0
14        Benz          Be1          NaN         5656.0

In [15]:
df=pd.read_csv("sample.csv")
newdf=df.add_prefix("car_")
newdf=df.add_suffix("_of_car")
newdf

   Name_of_car Brand_of_car Model_of_car  number_of_car
0          BMW           B1          NaN         4545.0
1         Benz          NaN           w2         5645.0
2          NaN           A1          NaN         8989.0
3          BMW           B1           w1            NaN
4         Benz          Be1           w2         3445.0
5          NaN           B1           w1           45.0
6         Benz          Be1          NaN         5656.0
7          NaN          Be1           w2         3445.0
8          BMW           B1           w1           45.0
9         Benz          Be1          NaN         5656.0
10        Benz          Be1          NaN         5656.0
11         NaN          Be1           w2         3445.0
12         BMW           B1           w1           45.0
13        Benz          Be1          NaN         5656.0
14        Benz          Be1          NaN         5656.0

In [16]:
df=pd.read_csv("sample.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    11 non-null     object
 1   Brand   14 non-null     object
 2   Model   8 non-null      object
 3   number  14 non-null     float64
dtypes: float64(1), object(3)
memory usage: 612.0+ bytes

In [25]:
df=pd.read_csv("sample.csv")


df.dropna()
# df

    Name Brand Model  number
4   Benz   Be1    w2  3445.0
8    BMW    B1    w1    45.0
12   BMW    B1    w1    45.0

In [26]:
df=pd.read_csv("sample.csv")
df.dropna(inplace=True)
df

    Name Brand Model  number
4   Benz   Be1    w2  3445.0
8    BMW    B1    w1    45.0
12   BMW    B1    w1    45.0

In [28]:
df=pd.read_csv("sample.csv")
df.dropna(subset=["Name","Brand"])

    Name Brand Model  number
0    BMW    B1   NaN  4545.0
3    BMW    B1    w1     NaN
4   Benz   Be1    w2  3445.0
6   Benz   Be1   NaN  5656.0
8    BMW    B1    w1    45.0
9   Benz   Be1   NaN  5656.0
10  Benz   Be1   NaN  5656.0
12   BMW    B1    w1    45.0
13  Benz   Be1   NaN  5656.0
14  Benz   Be1   NaN  5656.0

In [32]:
df=pd.read_csv("sample.csv")
df.fillna(0,inplace=True)
df

    Name Brand Model  number
0    BMW    B1     0  4545.0
1   Benz     0    w2  5645.0
2      0    A1     0  8989.0
3    BMW    B1    w1     0.0
4   Benz   Be1    w2  3445.0
5      0    B1    w1    45.0
6   Benz   Be1     0  5656.0
7      0   Be1    w2  3445.0
8    BMW    B1    w1    45.0
9   Benz   Be1     0  5656.0
10  Benz   Be1     0  5656.0
11     0   Be1    w2  3445.0
12   BMW    B1    w1    45.0
13  Benz   Be1     0  5656.0
14  Benz   Be1     0  5656.0

In [40]:
df=pd.read_csv("sample.csv")
df["Name"].fillna("TATA",inplace=True)
df

C:\Users\ANJAL\AppData\Local\Temp\ipykernel_7256\4209362535.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Name"].fillna("TATA",inplace=True)

    Name Brand Model  number
0    BMW    B1   NaN  4545.0
1   Benz   NaN    w2  5645.0
2   TATA    A1   NaN  8989.0
3    BMW    B1    w1     NaN
4   Benz   Be1    w2  3445.0
5   TATA    B1    w1    45.0
6   Benz   Be1   NaN  5656.0
7   TATA   Be1    w2  3445.0
8    BMW    B1    w1    45.0
9   Benz   Be1   NaN  5656.0
10  Benz   Be1   NaN  5656.0
11  TATA   Be1    w2  3445.0
12   BMW    B1    w1    45.0
13  Benz   Be1   NaN  5656.0
14  Benz   Be1   NaN  5656.0

In [41]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df.add(15)

    0
0  16
1  17
2  18
3  19
4  20

In [51]:
x={"A":[1,2,3,4,5],"B":[6,7,8,9,10]}
df=pd.DataFrame(x)
# df
df["C"]=df["A"]+df["B"]
# df["C"]=df["A"].add(5)
df

   A   B   C
0  1   6   7
1  2   7   9
2  3   8  11
3  4   9  13
4  5  10  15

In [56]:
data={"X":[50,40,30],"Y":[100.3,20,300],"Z":[1,2,3]}
df=pd.DataFrame(data)
print(df)
df.sum(axis=1)
# df["X"].sum()
# df

    X      Y  Z
0  50  100.3  1
1  40   20.0  2
2  30  300.0  3

0    151.3
1     62.0
2    333.0
dtype: float64